//=============================================================================
//
// タイトル処理 [title.h]
// Author : 羽鳥太一
//
//=============================================================================
#ifndef _EDTER_H_
#define _EDTER_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "scene.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CBlock;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CEdter : public CScene
{
public:
	CEdter(LAYER_TYPE Layer = LAYER_TYPE::LAYER_00);	// デフォルトコンストラクタ
	~CEdter();	// デフォルトデストラクタ
	HRESULT Init(void);	// ポリゴンの初期化()
	void Uninit(void);	// ポリゴンの終了
	void Update(void);	// ポリゴンの更新
	void Draw(void);	// ポリゴンの描画
	static CBlock *GetModel(void);
private:
	void OutPut(void);	// テキストファイルに出力
	void UpdateModel(void);	// モデルの移動
	static vector<CBlock*> m_Model;	// 文字ポリゴン
	static int m_nMaxModel;
	int *m_npModel;
	int m_nTimer;
	int m_nMove;
	bool m_bUse;
};

#endif