//---------------------------
//インクルードファイル
//---------------------------
#include "light.h"
#include "manager.h"
#include "renderer.h"

//=============================================================================
// 静的メンバ変数宣言
//=============================================================================
int	CLight::m_nMaxNumber = 0;

//=============================================================================
// デフォルトコンストラクタ
//=============================================================================
CLight::CLight()
{
	m_nMyNumber = m_nMaxNumber;
	m_nMaxNumber++;
}

//=============================================================================
// デフォルトデストラクタ
//=============================================================================
CLight::~CLight()
{
	m_nMaxNumber--;
}

//=============================================================================
// 初期化
//=============================================================================
HRESULT CLight::Init(D3DLIGHTTYPE Type, D3DCOLORVALUE Diffuse, D3DVECTOR Pos, D3DVECTOR Dir)
{
	LPDIRECT3DDEVICE9 pDevice;	//デバイスのポインタ
	D3DXVECTOR3 VecDir;		//ベクトル

	pDevice = CManager::GetRenderer()->GetDevice();		//デバイスを取得する
	//---------------------------
	//ライトの設定
	//---------------------------
	//ライトのクリア
	ZeroMemory(	&m_Light,
				sizeof(D3DLIGHT9));

	//ライトの種類
	m_Light.Type = Type;	//種類

	//ライトの拡散光
	m_Light.Diffuse = Diffuse;	//色

	//ライトの場所
	m_Light.Position = Pos;

	//ライトの方向
	VecDir = Dir;

	//正規化する
	D3DXVec3Normalize(	&VecDir,
						&VecDir);

	//ライトの方向を入れる
	m_Light.Direction = VecDir;

	//ライトの設定
	pDevice->SetLight(m_nMyNumber, &m_Light);	//n番目のライトに設定した設定を入れる

	//ライトを有効にする
	pDevice->LightEnable(m_nMyNumber, TRUE);	//n番目のライトを付ける
	return S_OK;
}

//=============================================================================
// 終了
//=============================================================================
void CLight::Uninit(void)
{

}

//=============================================================================
// 更新処理
//=============================================================================
void CLight::Update(void)
{

}

//=============================================================================
// 生成
//=============================================================================
CLight *CLight::Create(D3DLIGHTTYPE Type, D3DCOLORVALUE Diffuse, D3DVECTOR Pos, D3DVECTOR Dir)
{
	CLight *pLight = NULL;
	if (pLight == NULL)
	{
		pLight = new CLight;
	}

	if (pLight)
	{
		pLight->Init(Type, Diffuse, Pos, Dir);
	}
	return pLight;
}