//=============================================================================
//
// ファイルロード処理 [fileload.h]
// Author : 羽鳥太一
//
//=============================================================================
#ifndef _FILE_LOAD_H_
#define _FILE_LOAD_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "main.h"

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CFileLoad
{
public:
	typedef struct 
	{
		vector<string> pas;				// テクスチャのパス
		pair<vector<string>, vector<string>> file_name_pas;	// パスと名前の読み込み
		map<string, int> type;		// テクスチャの種類
	} FILE_LOAD_DATA;
	CFileLoad();		//コンストラクタ
	~CFileLoad();		//デストラクタ
	static pair<vector<string>, vector<string>> Load(string load_file);	// ファイルロード
private:
};

#endif