//=======================================================================
//ライトに関する処理
//Aouthor: 加藤　瑞葵
//=======================================================================
#ifndef _LIGHT_H_
#define _LIGHT_H_
#include "main.h"

//========================================================
//マクロ定義
//========================================================
#define MAX_LIGHT (3)	//ライトの最大数

//========================================================
//構造体の定義
//========================================================

//================================================
//クラスの定義
//================================================
//クラスの定義
class CLight
{
public:
	CLight();					//コンストラクタ
	~CLight();					//デストラクタ

	//メンバ関数
	HRESULT Init(D3DXVECTOR3 vecDir, const D3DXVECTOR3 &pos);
	void Uninit(void);
	void Update(void);
	static CLight *Create(const D3DXVECTOR3 &vecDir, const D3DXVECTOR3 &pos);


private:
	D3DLIGHT9 m_light;			//ライト
	int m_nCnt;					//何番目のライトか
	static int m_nNum;			//ライトの総数
};

#endif //!_LIGHT_H_