//=============================================================================
//
// タイトル処理
// Author : 加藤瑞葵
//
//=============================================================================
#ifndef _TITLE_H_
#define _TITLE_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "object.h"
#include "input_keyboard.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CUi;
class CObject2D;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CTitle : public CObject
{
public:
	CTitle(PRIORITY priorty = PRIORITY::NONE);	// デフォルトコンストラクタ
	~CTitle();	// デフォルトデストラクタ
	HRESULT Init(void);	// 初期化
	void Uninit(void);	// 終了
	void Update(void);	// 更新
	void Draw(void);	// 描画

private:
	vector<CUi*> m_ui;	// UI
	vector<string> m_type;	// テクスチャ名
	CObject2D *m_pointor;	// マウスポインター
};

#endif // !_TITLE_H_