//===========================================
//チュートリアル処理
//Author:加藤瑞葵
//===========================================
#ifndef _TUTORIAL_H_
#define _TUTORIAL_H_

#include "object.h"

//================================================
//前方宣言
//================================================

//================================================
//クラスの定義
//================================================
//クラスの定義
class CTutorial : public CObject
{
public:
	CTutorial(PRIORITY priorty = PRIORITY::NONE);				//コンストラクタ
	~CTutorial();				//デストラクタ

	//メンバ関数
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

private:
};
//================================================
//プロトタイプ宣言
//================================================
#endif // !_TUTORIAL_H_